{"Magic The Gathering 2014 Core Set Booster Box": {"description": " Play with fire! See for yourself why Magic: The Gathering is the world\\xe2\\x80\\x99s premier trading card game. Customize your own Magic\\xe2\\x84\\xa2 deck with wild, powerful spells and creatures, then challenge your friends to see whose spark burns the brightest!", "price": 114.99}, "Magic The Gathering 2013 Intro Pack: Path to Victory": {"description": " Odric, Master Tactician believes that you can find strength in your friends . . . particularly if your friends are a highly trained military fighting force! The aggressive \"Path to Victory\" deck swarms your opponent with a never-ending supply of reinforcements.", "price": 24.99}, "Magic The Gathering 2013 Intro Pack: Depths of Power": {"description": " Led by Talrand, Sky Summoner, the \"Depths of Power\" deck specializes in casting instants and sorceries. If you've got Talrand on the battlefield, then any time you cast an instant or sorcery spell, Talrand creates a flying Drake token creature for you.", "price": 24.99}, "Magic The Gathering 2013 Intro Pack: Sole Domination": {"description": " The \"Sole Domination\" deck focuses on creatures with the exalted ability. If you attack with exactly one creature, each of your creatures with exalted boosts that creature by giving it +1/+1 for the turn\\xe2\\x80\\x94and you'll still have the other creatures back on defense!", "price": 34.99}, "Magic The Gathering 2013 Intro Pack: Wild Rush": {"description": " If you play by instinct, combining natural skill with unrelenting ferocity, you're sure to enjoy the \"Wild Rush\" deck led by Yeva, Nature's Herald. Yeva turns every green creature in your hand\\xe2\\x80\\x94including herself\\xe2\\x80\\x94into an opportunity for an ambush.", "price": 24.99}, "Magic The Gathering 2013 Intro Pack: Mob Rule": {"description": " Goblins have a simple philosophy: Why bother trying to outthink the opposition when you can just set them on fire instead? If this sounds good to you, join Krenko, Mob Boss with the \"Mob Rule\" deck.", "price": 34.99}, "Magic The Gathering 2011 Intro Pack: Power of Prophecy": {"description": " With the \"Power of Prophecy\" deck, you'll correctly predict your opponent's downfall! Your flying creatures give you superiority in the air; they're your best route to victory.", "price": 19.99}, "Magic The Gathering 2011 Intro Pack: Blades of Victory": {"description": " The \"Blades of Victory\" deck puts you in command of a righteous army of Soldiers, Knights, and Angels. You need to attack early and often, so start the game with aggressive creatures like Elite Vanguard and White Knight.", "price": 29.99}, "Magic The Gathering 2011 Intro Pack: Stampede of Beasts": {"description": " The \"Stampede of Beasts\" deck uses fearsome creatures to trample the opposition. Start the game off with Llanowar Elves and Sylvan Ranger.", "price": 34.99}, "Magic The Gathering 2011 Intro Pack: Breath of Fire": {"description": " The \"Breath of Fire\" deck is all about dealing damage. Direct-damage spells like Lightning Bolt, Chandra's Outrage, Lava Axe, and Fireball form the backbone of your deck.", "price": 29.99}, "Magic The Gathering 2011 Intro Pack: Reign of Vampirism": {"description": " The \"Reign of Vampirism\" deck unleashes the night's fiercest undead predators on your opponents. The key card in your deck is Captivating Vampire, which lets you gain control of your opponent's creature if you have five Vampires to tap.", "price": 24.99}, "Magic The Gathering 2012 Intro Pack: Entangling Webs": {"description": " If you believe that bigger is better, the \"Entangling Webs\" deck is right up your alley! Loaded with giant predators and crafty spiders, this deck is perfect for an all-out rumble in the jungle.", "price": 29.99}, "Magic The Gathering 2012 Intro Pack: Mystical Might": {"description": " Attack early, attack often! That's the motto of the \"Mystical Might\" deck, which seeks to overwhelm your opponents with elusive\\xe2\\x80\\x94and illusory\\xe2\\x80\\x94creatures before they can mount a defense.", "price": 39.99}, "Magic The Gathering 2012 Intro Pack: Grab for Power": {"description": " The ultimate goal of the \"Grab for Power\" deck is to have three specific artifacts\\xe2\\x80\\x94Crown of Empires, Scepter of Empires, and Throne of Empires\\xe2\\x80\\x94on the battlefield at the same time. If you've got all three, each one powers up, delivering not just a good effect (as it does normally), but an absurdly brutal effect. Your triumph won't be far behind.", "price": 29.99}, "Magic The Gathering 2012 Intro Pack: Sacred Assault": {"description": " The nice thing about being a powerful Planeswalker is that you don't have to play by the rules. For example, you have the ability to custom-build your ideal creature, and that's exactly what the \"Sacred Assault\" deck lets you do!", "price": 29.99}, "Magic The Gathering 2012 Intro Pack: Blood and Fire": {"description": " Some decks like to inflict pain. Other decks love to inflict pain. The \"Blood and Fire\" deck easily falls into the second category. Once you start dealing damage to your opponent, the frenzy begins!", "price": 39.99}, "Magic The Gathering 2013 Core Set Booster Box": {"description": " Play Magic: The Gathering and discover why it's the world's premier trading card game. Start with a deck of cards filled with potent spells and fearsome creatures. Then take on the mantle of a Planeswalker, a powerful mage, and challenge your friends-and yourself-in the ultimate battle of wits.", "price": 114.99}}