{"Yu-Gi-Oh Hidden Arsenal Chapter 1 Booster Mini-Box": {"description": " Bolster the Ice Barrier strategy from Structure Deck: Freezing Chains with even more \"Ice Barrier\" cards! Flood the field with the army of the Ice Barrier!", "price": 14.99}, "Yu-Gi-Oh Kuriboh Kollection 9 Pocket Portfolio": {"description": " Yu-Gi-Oh Kuriboh Kollection 9 Pocket Portfolio Each Duelist Portfolio includes 10-pages with 9 pockets per page, allowing you to display up to a total of 180 cards! Built with a side loading design, you will also get an extra layer of protection for your cards.", "price": 15.99}, "Yu-Gi-Oh Battle of Chaos Booster Box": {"description": " The first core booster of 2022, Battle of Chaos, breaks out in February! This 100-card set features new cards that work with Yugi Muto's Dark Magician, including a new Ritual Monster, a new Fusion Monster, and a new Dragon form of Timaeus!", "price": 79.99}, "Yu-Gi-Oh The Grand Creators Booster Box": {"description": " The Grand Creators wills 3 new strategies into existence and features a brand-new, World Premiere Spell Card for Inzektors, the winner of the 2020 Create-A-Card Project, selected by the Yu-Gi-Oh! community! ", "price": 74.99}, "Yu-Gi-Oh Brothers of Legend Booster Box": {"description": " Battles of Legend 2021 enters the fray this Fall! Multiply your fun with this all-foil booster set that introduces never-before-released cards from the first 6 Yu-Gi-Oh! animated series into the Yu-Gi-Oh! TRADING CARD GAME", "price": 84.99}, "Yu-Gi-Oh Maximum Gold El Dorado Box": {"description": " Gorgeous Premium Gold Rares return to give many of your favorite cards a classy new look! Premium Gold Rare Cards have raised golden outlines, borders, symbols, and icons that accentuate the artwork of and add texture to many of your favorite cards.", "price": 29.99}, "Yu-Gi-Oh Legendary Duelists Synchro Storm Booster Box": {"description": " The winds of victory are swift and sure! Legendary Duelists: Synchro Storm powers up three strategies used by Duelists that specialize in WIND monsters!", "price": 59.99}, "Yu-Gi-Oh Cyber Strike Structure Deck": {"description": " Structure Deck: Cyber Strike is the second Structure Deck of 2021 and similar to previous Structure Decks, the theme was chosen by the fans.", "price": 14.99}, "Yu-Gi-Oh Tin of Ancient Battles": {"description": " The eternal clash between the spirits of the Dark Magician and the Blue-Eyes White Dragon are immortalized in this carving, along with 3 brand-new World Premiere cards to give these monsters a new power boost.", "price": 24.99}, "Yu-Gi-Oh Dawn of Majesty Booster Box": {"description": " Lightning Overdrive gave Duelists everywhere an upgraded form of Black Rose Dragon, now Dawn of Majesty will introduce a new upgrade path for Stardust Dragon and numerous cards to help you Summon it.", "price": 74.99}, "Yu-Gi-Oh Duelist Slifer, Obelisk and Ra 9 Pocket Portfolio": {"description": " Yu-Gi-Oh Duelist Slifer, Obelisk and Ra 9 Pocket Portfolio Each Duelist Portfolio includes 10-pages with 9 pockets per page, allowing you to display up to a total of 180 cards! Built with a side loading design, you will also get an extra layer of protection for your cards.", "price": 14.99}, "Yu-Gi-Oh Egyptian Gods Structure Deck - Obelisk the Tormentor": {"description": " If you\\xe2\\x80\\x99ve ever wanted to build a Deck around an Egyptian God Card but didn\\xe2\\x80\\x99t know where to start, look no further than the Egyptian God Decks! Egyptian God Deck", "price": 11.99}, "Yu-Gi-Oh Egyptian Gods Structure Deck - Slifer The Sky Dragon": {"description": " Slifer the Sky Dragon and Egyptian God Deck: Obelisk the Tormentor serve up simple strategies to Summon and win with either Slifer the Sky Dragon or Obelisk the Tormentor.", "price": 11.99}, "Yu-Gi-Oh Lightning Overdrive Booster Box": {"description": " Lightning Overdrive is poised to shock the Dueling world and reinvigorate not one, but TWO beloved monsters from the worlds of the Yu-Gi-Oh! animated series!", "price": 74.99}, "Yu-Gi-Oh Ancient Guardians Booster Box": {"description": " Finally, a new theme with a spin on Synchro Summoning so cool it'll send a chill down your opponent's spine! Look for more information on exactly how it'll work in 2021.", "price": 74.99}, "Yu-Gi-Oh Duelist Dark Magician Girl The Dragon Knight 9 Pocket Portfolio": {"description": " Yu-Gi-Oh Duelist Dark Magician Girl The Dragon Knight 9 Pocket Portfolio Each Duelist Portfolio includes 10-pages with 9 pockets per page, allowing you to display up to a total of 180 cards! Built with a side loading design, you will also get an extra layer of protection for your cards.", "price": 14.99}, "YU-GI-OH FREEZING CHAINS STRUCTURE DECK": {"description": " YU-GI-OH FREEZING CHAINS STRUCTURE DECK As winter grows colder, the icy prison cannot withhold the growing storm within, and the return of Trishula is nigh. The Synchro Monsters of the Ice Barrier break free in Structure Deck: Freezing Chains!", "price": 11.99}, "YU-GI-OH BLAZING VORTEX BOOSTER BOX": {"description": " YU-GI-OH BLAZING VORTEX BOOSTER BOX Level up your game with 100 new cards to play and collect including a reimagining of Chazz Princeton's \"Armed Dragon\" cards from the Yu-Gi-Oh! GX animated series.", "price": 74.99}, "YU-GI-OH GENESIS IMPACT BOOSTER BOX": {"description": " YU-GI-OH GENESIS IMPACT BOOSTER BOX Master three brand-new Deck strategies while keeping your eyes peeled for Collector's Rares in December's new 60-card booster set, Genesis Impact!", "price": 74.99}, "YU-GI-OH SPIRIT CHARMERS STRUCTURE DECK": {"description": " YU-GI-OH SPIRIT CHARMERS STRUCTURE DECK5 Ultra Rares (4 fixed + 1 of 4 Variant Art cards) 2 Super Rares 35 Commons 1 of 5 Super Rare Token Cards 1 of 5 Double-sided Deluxe Game Mats/Dueling Guide", "price": 11.99}, "Yu-Gi-Oh Dragons of Legend Complete Series Box": {"description": " Yu-Gi-Oh Dragons of Legend Complete Series Box Following up on Legendary Duelists: Season 1, another box-with-a-blast-from-the-past is coming your way with Dragons of Legend: The Complete Series!", "price": 19.99}, "Yu-Gi-Oh Tin of Lost Memories": {"description": " Yu-Gi-Oh Tin of Lost Memories Each Tin this year will contain 3 bigger-than-ever Mega-Packs, each with 2 more foils than in last year's Tin Mega-Packs! So every 2020 Mega-Pack will contain 1 Prismatic Secret Rare, 2 Ultra Rares, 2 Super Rares, 1 Rare, and 12 Commons.", "price": 29.99}, "Yu-Gi-Oh Mechanized Madness Structure Deck": {"description": " Yu-Gi-Oh Mechanized Madness Structure Deck All hands, man the battle stations! The colossal Machina army is back with vengeance in Structure Deck: Mechanized Madness!", "price": 11.99}, "Yu-Gi-Oh Duelist Ash Blossom 9 Pocket Portfolio": {"description": " Since its release, Ash Blossom &amp; Joyous Spring has become one of the most popular and powerful options a Duelist can add to their Deck. ", "price": 16.99}, "Yu-Gi-Oh Chaos Impact Special Edition": {"description": " Chaos Impact Special Edition packs all the chaos from this Fall's booster set, with an impact that won't break the bank! Each box includes 3 booster packs of Chaos Impact in addition to 2 of 4 Super Rare variant cards.", "price": 11.99}, "Yu-Gi-Oh Fists of Gadgets Booster Box": {"description": " Turn up the heat this summer with Fists of the Gadgets, a 60-card all-foil booster set that heralds the return of one of the most popular monster themes of all-time: The Brotherhood of the Fire Fist!", "price": 74.99}, "Yu-Gi-Oh Speed Duel Starter Decks Ultimate Predators": {"description": " Rex Raptor and Weevil Underwood, 2 of the most notorious rivals from Yu-Gi-Oh!, have arrived to Speed Duel!", "price": 11.99}, "Yu-Gi-Oh Code of the Duelist Special Edition Box": {"description": " The Code of the Duelist Special Edition is the ultimate value for Duelists! In addition to 3 booster packs of Code of the Duelist, each box is guaranteed 1 of 2 Super Rare variant cards, PLUS 1 of 2 Super Rare preview cards of non-foil cards from the upcoming Fall 2017 booster set!", "price": 11.99}, "Yu-Gi-Oh Dinosmasher's Fury Structure Deck": {"description": " For those of you who prefer natural history over mankind's machinations, the Dinosmasher's Fury Structure Deck provides the ultimate prehistoric Dueling experience!", "price": 11.99}, "Yu-Gi-Oh Raging Tempest Special Edition Box": {"description": " Each box of Raging Tempest Special Edition comes with 3 booster packs of Raging Tempest, plus 1 of 2 foil version preview cards from the Spring 2017 booster PLUS 1 of 2 Super Rare variant cards!", "price": 11.99}, "Yu-Gi-Oh Arc-V Star Pack French Booster Box": {"description": " Designed to appeal to Yu-Gi-Oh! fans of all ages, the Star Pack ARC-V booster set offers Duelists a slew of awesome cards at an incredible value. With an SRP of only $0.99, Dueling and collecting are as easily affordable as ever!", "price": 29.99}}